zhanglazhuan/NomadCast/debug/t_usb_msc/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Console via USB Serial/JTAG (separate peripheral from USB OTG used for MSC)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Board: 16MB flash + 8MB octal PSRAM
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# TinyUSB Mass Storage Class
CONFIG_TINYUSB_MSC_ENABLED=y

# FatFS (required by TinyUSB MSC storage). USE_LABEL must be set explicitly:
# IDF v5.5's ffconf.h maps FF_USE_LABEL -> CONFIG_FATFS_USE_LABEL with no
# #ifdef guard, so leaving it "not set" breaks the build.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_FS_LOCK=0
CONFIG_FATFS_TIMEOUT_MS=10000
CONFIG_FATFS_PER_FILE_CACHE=y
CONFIG_FATFS_USE_LABEL=y
